SeanSouth/O1_demo/doc/DA14680AD.xml
	<addressOffset>0x0000008a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00006001</resetMask>
	<fields>
	<field>
	<name>ADC_SIGN</name>
	<description>Change polarity of ADC input. </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ADC_MUTE</name>
	<description>0: Normal operation
1: Short the inputs of the ADC (used for DC offset cal) </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ADC_DC_OFFSET_SEL</name>
	<description>0: Normal operation (i.e. Use automatically calibrated value)
1: Use ADC_OFFx_y_WR to set the DC offset compensation values in the ADC (x = N or P, y = I or Q </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ADC_CTRL2_REG</name>
	
	<addressOffset>0x0000008c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_I_WR</name>
	<description>External value for the DC offset compensation in the I path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ADC_OFFP_I_WR</name>
	<description>External value for the DC offset compensation in the I path positive side. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ADC_CTRL3_REG</name>
	
	<addressOffset>0x0000008e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ADC_OFFP_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path positive side. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_BIAS_CTRL1_BLE_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00006888</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IFF_BIAS_BLE_SET</name>
	<description>Tuning of the IF filter bias current when mode='BLE'</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>VCO_BIAS_BLE_SET</name>
	<description>Tuning of the VCO bias current when mode='BLE'</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_BIAS_BLE_SET</name>
	<description>Tuning of the charge pump bias current when mode = 'BLE'</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_BIAS_BLE_SET</name>
	<description>Tuning of the mixer bias current when mode='BLE' </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_BIAS_CTRL1_FTDF_REG</name>
	
	<addressOffset>0x00000086</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000c888</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IFF_BIAS_FTDF_SET</name>
	<description>Tuning of the IF filter bias current when mode='FTDF'</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>VCO_BIAS_FTDF_SET</name>
	<description>Tuning of the VCO bias current when mode='FTDF'</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_BIAS_FTDF_SET</name>
	<description>Tuning of the charge pump bias current when mode = 'FTDF'</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_BIAS_FTDF_SET</name>
	<description>Tuning of the mixer bias current when mode='FTDF' </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CALSTATE_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CALSTATE</name>
	<description>Value of the calstate state machine </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CAL_CTRL_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CAL_DIS</name>
	<description>Do not calibrate the VCO during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DC_OFFSET_CAL_DIS</name>
	<description>Do not calibrate the VGA2 Offset during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>IFF_CAL_DIS</name>
	<description>Do not calibrate the IFF center frequency during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MGAIN_CAL_DIS</name>
	<description>Do not calibrate the VCO and Modulation Gain during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>EO_CAL</name>
	<description>End of calibration trigger.
Reading returns the eo_cal status signal which can be cleared by writing to RF_IRQ_CTRL_REG.EO_CAL_CLEAR </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SO_CAL</name>
	<description>Start of calibration trigger.Writing a 1 starts calibration.1Reading returns the calibration status (1 = busy calibrating). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CP_CTRL_BLE_REG</name>
	
	<addressOffset>0x00000098</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007f7f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CP_CUR_BLE_TX</name>
	<description>CP current setting during PLL - Lock in TX mode
1111: 45 &#181;A (fastest, setting 0)
0111: 15 &#181;A (setting 1)
0011: 7.5 &#181;A (setting 2)
0001: 3.75 &#181;A (slowest, setting 3)
Intermediate values are possible (but not recommended). Calculate the effective value with:
bit 0: 3.75 &#181;A
bit 1: 3.75 &#181;A
bit 2: 7.5 &#181;A
bit 3: 30 &#181;A </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_CUR_BLE_RX</name>
	<description>CP current setting during PLL - lock in RX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_CUR_SET_BLE_TX</name>
	<description>Chargepump current setting during PLL settling in TX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_CUR_SET_BLE_RX</name>
	<description>Chargepump current setting during PLL settling in RX mode.
same coding as for CP_CUR_TX</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CP_CTRL_FTDF_REG</name>
	
	<addressOffset>0x0000009a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007f7f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CP_CUR_FTDF_TX</name>
	<description>CP current setting during PLL - Lock in TX mode
1111: 45 &#181;A (fastest, setting 0)
0111: 15 &#181;A (setting 1)
0011: 7.5 &#181;A (setting 2)
0001: 3.75 &#181;A (slowest, setting 3)
Intermediate values are possible (but not recommended). Calculate the effective value with:
bit 0: 3.75 &#181;A
bit 1: 3.75 &#181;A
bit 2: 7.5 &#181;A
bit 3: 30 &#181;A </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_CUR_FTDF_RX</name>
	<description>CP current setting during PLL - lock in RX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_CUR_SET_FTDF_TX</name>
	<description>Chargepump current setting during PLL settling in TX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CP_CUR_SET_FTDF_RX</name>
	<description>Chargepump current setting during PLL settling in RX mode.
same coding as for CP_CUR_TX</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_DIAGIRQ01_REG</name>
	<description>BLE/RF Diagnostic IRQ Control Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007f7f</resetMask>
	<fields>
	<field>
	<name>DIAGIRQ_EDGE_1</name>
	<description>Same as DIAGIRQ_EDGE_0.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_BSEL_1</name>
	<description>Same as DIAGIRQ_BSEL_0.</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_WSEL_1</name>
	<description>Same as DIAGIRQ_WSEL_0.</description>
	<access>read-write</access>
	<bitRange>[10:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_MASK_1</name>
	<description>Same as DIAGIRQ_MASK_0.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_EDGE_0</name>
	<description>Diagnostic IRQ Edge 0
Selects the edge of the selected bit (refer to DIAGIRQ_BSEL_0) that will trigger the assertion of DIAGIRQ_STAT_0.
If '0' then the positive edge is selected, when "1" the negative edge is selected.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_BSEL_0</name>
	<description>Diagnostic IRQ Bit Select 0
Selects the bit of the 8-bit bus (as selected by the DIAGIRQ_WSEL_0) that will be used for the IRQ generation.</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_WSEL_0</name>
	<description>Diagnostic IRQ Word Select 0
Selects the 8-bit diagnostic bus that will be used for the IRQ generation.
00: Selects the BLE_DIAG0
01: Selects the BLE_DIAG1
10: Selects the RADIO_DIAG0
11: Selects the RADIO_DIAG1</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_MASK_0</name>
	<description>Diagnostic IRQ Mask 0
When set to "1" a BLE_RF_DIAG_IRQ will be generated on each rise of the DIAGIRQ_STAT_0 bit.
When cleared to "0" no IRQ will be generated.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_DIAGIRQ23_REG</name>
	<description>BLE/RF Diagnostic IRQ Control Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007f7f</resetMask>
	<fields>
	<field>
	<name>DIAGIRQ_EDGE_3</name>
	<description>Same as DIAGIRQ_EDGE_0.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_BSEL_3</name>
	<description>Same as DIAGIRQ_BSEL_0.</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_WSEL_3</name>
	<description>Same as DIAGIRQ_WSEL_0.</description>
	<access>read-write</access>
	<bitRange>[10:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_MASK_3</name>
	<description>Same as DIAGIRQ_MASK_0.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_EDGE_2</name>
	<description>Same as DIAGIRQ_EDGE_0.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_BSEL_2</name>
	<description>Same as DIAGIRQ_BSEL_0.</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_WSEL_2</name>
	<description>Same as DIAGIRQ_WSEL_0.</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_MASK_2</name>
	<description>Same as DIAGIRQ_MASK_0.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_DIAGIRQ_STAT_REG</name>
	<description>BLE/RF Diagnostic IRQ Status Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>DIAGIRQ_STAT_3</name>
	<description>Same as DIAGIRQ_STAT_0.</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_STAT_2</name>
	<description>Same as DIAGIRQ_STAT_0.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_STAT_1</name>
	<description>Same as DIAGIRQ_STAT_0.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIAGIRQ_STAT_0</name>
	<description>Diagnostic IRQ Status 0
This bit is read only. It is automatically cleared to "0" on each read of the BLE_RF_DIAGIRQ_REG register. It is automatically asserted to "1" on each detection of the selected edge, of the selected bit, of the selected word.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_DIV_IQ_RX_REG</name>
	<description>Bias trimming of IQ divider</description>
	<addressOffset>0x000000d2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>DIV2_IQ_TRIM_RX_SPARE</name>
	<description>Function not defined yet</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIV2_OFFP_TRIM_RX</name>
	<description>Trim value for 2 divider P-Most bias in RX mode</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIV2_OFFN_TRIM_RX</name>
	<description>Trim value for 2 divider N-Most bias in RX mode</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_DIV_IQ_TX_REG</name>
	<description>Bias trimming of IQ divider</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>DIV2_IQ_TRIM_TX_SPARE</name>
	<description>Function not defined yet</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIV2_OFFP_TRIM_TX</name>
	<description>Trim value for 2 divider P-Most bias in TX mode</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIV2_OFFN_TRIM_TX</name>
	<description>Trim value for 2 divider N-Most bias in TX mode</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_IFF_CAL_CAP_STAT_REG</name>
	<description>Current CAL_CAP value applied to IF</description>
	<addressOffset>0x000000ea</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_RD</name>
	
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_IFF_CC_BLE_SET1_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_IFF_CC_BLE_SET2_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_IFF_CC_FTDF_SET1_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_IFF_CC_FTDF_SET2_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_IFF_CTRL1_REG</name>
	
