SeanSouth/O1_demo/doc/DA14680AD.xml
	<addressOffset>0x0000012c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_23_REG</name>
	
	<addressOffset>0x0000012e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_24_REG</name>
	
	<addressOffset>0x00000130</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_25_REG</name>
	
	<addressOffset>0x00000132</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_26_REG</name>
	
	<addressOffset>0x00000134</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_27_REG</name>
	
	<addressOffset>0x00000136</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_28_REG</name>
	
	<addressOffset>0x00000138</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_29_REG</name>
	
	<addressOffset>0x0000013a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_2_REG</name>
	
	<addressOffset>0x00000104</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000508</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_30_REG</name>
	
	<addressOffset>0x0000013c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_31_REG</name>
	
	<addressOffset>0x0000013e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_3_REG</name>
	
	<addressOffset>0x00000106</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000410</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_4_REG</name>
	
